# BoltSpacing2LongerFlange Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
StructuralSectionLAngle..::..BoltSpacing2LongerFlange Property
StructuralSectionLAngle Class See Also
---
Standard bolt spacing second row in the longer flange, in. (mm)
**Namespace:** Autodesk.Revit.DB.Structure.StructuralSections**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2015
# Syntax
C#
---
```text
public double BoltSpacing2LongerFlange { get; set; }
```

Visual Basic
---
```text
Public Property BoltSpacing2LongerFlange As Double
	Get
	Set
```

Visual C++
---
```text
public:
property double BoltSpacing2LongerFlange {
	double get ();
	void set (double value);
}
```

# See Also
StructuralSectionLAngle Class
Autodesk.Revit.DB.Structure.StructuralSections Namespace